Tekla.Structures.Drawing.Size
The Size class contains the width and height properties.

Tekla.Structures.Drawing.Size.Width
Gets or sets the width value of the size instance.

Tekla.Structures.Drawing.Size.Height
Gets or sets the height value of the size instance.

Tekla.Structures.Drawing.Size.#ctor
Creates a new size instance with zero width and height.

Tekla.Structures.Drawing.Size.#ctor(System.Double,System.Double)
Creates a new size instance with the specified width and height.
Width: The width to be used.
Height: The height to be used.

Tekla.Structures.Drawing.Size.ToString
Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
Returns:  A string that represents this instance using default separator character "x".
This example shows how to convert a Tekla.Structures.Drawing.Size instance into a string representation.
The result is affected by the value of the advanced option: XS_USE_ONLY_INCHES_IN_SHEET_SIZES.
In order for this advanced option to work, set the advanced options XS_IMPERIAL and XS_IMPERIAL_INPUT to TRUE.
If the advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES is set to TRUE the result would display as: 17"x10"1/2
but if set to FALSE it would display as: 431.8x266.7
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 431.8x266.7 millimeters.
Size size = new Size(431.8, 266.7);
string formattedString = size.ToString();
}
}

Tekla.Structures.Drawing.Size.ToString(System.String)
Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
separator: The separator characters(s).
Returns:  A string that represents this instance using the specified separator character(s).
This example shows how to convert a Tekla.Structures.Drawing.Size instance into a string representation using
a specific separator parameter.
The result is affected by the value of the advanced option: XS_USE_ONLY_INCHES_IN_SHEET_SIZES.
In order for this advanced option to work, set the advanced options XS_IMPERIAL and XS_IMPERIAL_INPUT to TRUE.
If the advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES is set to TRUE the result would display as: 17" by 10"1/2
but if set to FALSE it would display as: 431.8 by 266.7
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 431.8x266.7 millimeters.
Size size = new Size(431.8, 266.7);
string formattedString = size.ToString(" by ");
}
}

Tekla.Structures.Drawing.Size.ToString(System.IFormatProvider,System.String)
Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
formatProvider: The format provider.
separator: The optional separator characters(s) - defaults to "x".
Returns:
A string that represents this instance.
This example shows how to convert a Tekla.Structures.Drawing.Size instance into a string representation using
a format provider and optionally a specific separator parameter.
The result is affected by the value of the advanced option: XS_USE_ONLY_INCHES_IN_SHEET_SIZES.
In order for this advanced option to work, set the advanced options XS_IMPERIAL and XS_IMPERIAL_INPUT to TRUE.
If the advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES is set to TRUE the result would display as: 17" * 10"1/2
but if set to FALSE it would display as: 431,8 * 266,7
If not specified, the separator defaults to: x (lower case).
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 431.8x266.7 millimeters.
Size size = new Size(431.8, 266.7);
var germanCulture = System.Globalization.CultureInfo.CreateSpecificCulture("de-DE");
string formattedString = size.ToString(germanCulture, " * ");
}
}